In [1]:
import pandas as pd

In [2]:
# read data property
property_data = pd.read_csv('property_data.csv')

# menampilkan semua data property
property_data

,lai,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000,104,PUTNAM,Y,3.0,1.0,900.0
1,100002000,197,LXT,N,1.0,1.0,NaN
2,100003000,199,LEXINGTON,N,NaN,1.0,850.0
3,100004000,201,berkeley,Y,1.0,NaN,700.0
4,100004000,201,berkeley,Y,1.0,NaN,700.0
5,100005000,203,BERKELEY,Y,3.0,2.0,975.0
6,100006000,207,Berkeley,Y,NaN,1.0,800.0
7,100007000,209,WASHINGTON,NaN,2.0,1.0,950.0
8,100008000,213,TREMONT,Y,1.0,1.0,NaN
9,100009000,215,TREMONT,Y,NaN,2.0,88000.0
10,100007000,209,WASHINGTON,NaN,2.0,1.0,950.0

In [3]:
# mengecek missing value pada property data
property_data.isna()

      lai  ST_NUM  ST_NAME  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0   False   False    False         False         False     False  False
1   False   False    False         False         False     False   True
2   False   False    False         False          True     False  False
3   False   False    False         False         False      True  False
4   False   False    False         False         False      True  False
5   False   False    False         False         False     False  False
6   False   False    False         False          True     False  False
7   False   False    False          True         False     False  False
8   False   False    False         False         False     False   True
9   False   False    False         False          True     False  False
10  False   False    False          True         False     False  False

In [4]:
# Menghitung jumlah missing value pada tiap kolom
property_data.isna().sum()

lai             0
ST_NUM          0
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        2
SQ_FT           2
dtype: int64

In [5]:
# Menghitung jumlah missing value pada tiap kolom
property_data.isna().sum() / len(property_data) * 100

lai              0.000000
ST_NUM           0.000000
ST_NAME          0.000000
OWN_OCCUPIED    18.181818
NUM_BEDROOMS    27.272727
NUM_BATH        18.181818
SQ_FT           18.181818
dtype: float64

In [6]:
property_data.isnull()

      lai  ST_NUM  ST_NAME  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0   False   False    False         False         False     False  False
1   False   False    False         False         False     False   True
2   False   False    False         False          True     False  False
3   False   False    False         False         False      True  False
4   False   False    False         False         False      True  False
5   False   False    False         False         False     False  False
6   False   False    False         False          True     False  False
7   False   False    False          True         False     False  False
8   False   False    False         False         False     False   True
9   False   False    False         False          True     False  False
10  False   False    False          True         False     False  False

In [7]:
# Menghitung jumlah missing value pada tiap kolom
property_data.isnull().sum()

lai             0
ST_NUM          0
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        2
SQ_FT           2
dtype: int64

In [8]:
# Menghitung jumlah missing value pada tiap kolom
property_data.isnull().sum() / len(property_data) * 100

lai              0.000000
ST_NUM           0.000000
ST_NAME          0.000000
OWN_OCCUPIED    18.181818
NUM_BEDROOMS    27.272727
NUM_BATH        18.181818
SQ_FT           18.181818
dtype: float64